Revit 2027 API
BoundaryConditions.CreatePointBoundaryConditions Method
Overload List
Name | Description
CreatePointBoundaryConditions(Document, Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new hosted point boundary conditions within the project.
CreatePointBoundaryConditions(Document, ElementId, XYZ, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new custom point boundary conditions within the project.
Top
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace